content/man/man1/git-replay.1.org
#+TITLE: Manpages - git-replay.1
* NAME
git-replay - EXPERIMENTAL: Replay commits on a new base, works with bare
repos too

* SYNOPSIS
#+begin_example
(EXPERIMENTAL!) git replay ([--contained] --onto <newbase> | --advance <branch>) <revision-range>...
#+end_example

* DESCRIPTION
Takes ranges of commits and replays them onto a new location. Leaves the
working tree and the index untouched, and updates no references. The
output of this command is meant to be used as input to *git update-ref
--stdin*, which would update the relevant branches (see the OUTPUT
section below).

THIS COMMAND IS EXPERIMENTAL. THE BEHAVIOR MAY CHANGE.

* OPTIONS
--onto <newbase>

#+begin_quote
Starting point at which to create the new commits. May be any valid
commit, and not just an existing branch name.

When *--onto* is specified, the update-ref command(s) in the output will
update the branch(es) in the revision range to point at the new commits,
similar to the way how *git rebase --update-refs* updates multiple
branches in the affected range.

#+end_quote

--advance <branch>

#+begin_quote
Starting point at which to create the new commits; must be a branch
name.

When *--advance* is specified, the update-ref command(s) in the output
will update the branch passed as an argument to *--advance* to point at
the new commits (in other words, this mimics a cherry-pick operation).

#+end_quote

<revision-range>

#+begin_quote
Range of commits to replay. More than one <revision-range> can be
passed, but in *--advance <branch>* mode, they should have a single tip,
so that it's clear where <branch> should point to. See "Specifying
Ranges" in *git-rev-parse*(1) and the "Commit Limiting" options below.

#+end_quote

