public/man/man1/git-replay.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>
        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - git-replay.1 | Technical Notes</title>

      <link rel="stylesheet" href="/css/main.min.a9ecaac9d4f7845fc2de4738f7709cab0bd1c3d19c3466fadd637a6987603257.css" integrity="sha256-qeyqydT3hF/C3kc493CcqwvRw9GcNGb63WN6aYdgMlc=" crossorigin="anonymous">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - git-replay.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>git-replay - EXPERIMENTAL: Replay commits on a new base, works with bare
repos too</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<pre class="example">
(EXPERIMENTAL!) git replay ([--contained] --onto &lt;newbase&gt; | --advance &lt;branch&gt;) &lt;revision-range&gt;...
</pre>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>Takes ranges of commits and replays them onto a new location. Leaves the
working tree and the index untouched, and updates no references. The
output of this command is meant to be used as input to <strong>git update-ref
–stdin</strong>, which would update the relevant branches (see the OUTPUT
section below).</p>
<p>
THIS COMMAND IS EXPERIMENTAL. THE BEHAVIOR MAY CHANGE.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>–onto &lt;newbase&gt;</p>
<blockquote>
<p>Starting point at which to create the new commits. May be any valid
commit, and not just an existing branch name.</p>
<p>
When <strong>–onto</strong> is specified, the update-ref command(s) in the output will
update the branch(es) in the revision range to point at the new commits,
similar to the way how <strong>git rebase –update-refs</strong> updates multiple
branches in the affected range.</p>
</blockquote>
<p>
–advance &lt;branch&gt;</p>
<blockquote>
<p>Starting point at which to create the new commits; must be a branch
name.</p>
<p>
When <strong>–advance</strong> is specified, the update-ref command(s) in the output
will update the branch passed as an argument to <strong>–advance</strong> to point at
the new commits (in other words, this mimics a cherry-pick operation).</p>
</blockquote>
<p>
&lt;revision-range&gt;</p>
<blockquote>
<p>Range of commits to replay. More than one &lt;revision-range&gt; can be
passed, but in <strong>–advance &lt;branch&gt;</strong> mode, they should have a single tip,
so that it&#39;s clear where &lt;branch&gt; should point to. See &#34;Specifying
Ranges&#34; in *git-rev-parse*(1) and the &#34;Commit Limiting&#34; options below.</p>
</blockquote>
