content/man/man1/git-replay.1.org
** Commit Limiting
Besides specifying a range of commits that should be listed using the
special notations explained in the description, additional commit
limiting may be applied.

Using more options generally further limits the output (e.g.
*--since=<date1>* limits to commits newer than *<date1>*, and using it
with *--grep=<pattern>* further limits to commits whose log message has
a line that matches *<pattern>*), unless otherwise noted.

Note that these are applied before commit ordering and formatting
options, such as *--reverse*.

-<number>, -n <number>, --max-count=<number>

#+begin_quote
Limit the number of commits to output.

#+end_quote

--skip=<number>

#+begin_quote
Skip /number/ commits before starting to show the commit output.

#+end_quote

--since=<date>, --after=<date>

#+begin_quote
Show commits more recent than a specific date.

#+end_quote

--since-as-filter=<date>

#+begin_quote
Show all commits more recent than a specific date. This visits all
commits in the range, rather than stopping at the first commit which is
older than a specific date.

#+end_quote

--until=<date>, --before=<date>

#+begin_quote
Show commits older than a specific date.

#+end_quote

--author=<pattern>, --committer=<pattern>

#+begin_quote
Limit the commits output to ones with author/committer header lines that
match the specified pattern (regular expression). With more than one
*--author=<pattern>*, commits whose author matches any of the given
patterns are chosen (similarly for multiple *--committer=<pattern>*).

#+end_quote

--grep-reflog=<pattern>

#+begin_quote
Limit the commits output to ones with reflog entries that match the
specified pattern (regular expression). With more than one
*--grep-reflog*, commits whose reflog message matches any of the given
patterns are chosen. It is an error to use this option unless
*--walk-reflogs* is in use.

#+end_quote

--grep=<pattern>

#+begin_quote
Limit the commits output to ones with a log message that matches the
specified pattern (regular expression). With more than one
*--grep=<pattern>*, commits whose message matches any of the given
patterns are chosen (but see *--all-match*).

When *--notes* is in effect, the message from the notes is matched as if
it were part of the log message.

#+end_quote

--all-match

#+begin_quote
Limit the commits output to ones that match all given *--grep*, instead
of ones that match at least one.

#+end_quote

--invert-grep

#+begin_quote
Limit the commits output to ones with a log message that do not match
the pattern specified with *--grep=<pattern>*.

#+end_quote

-i, --regexp-ignore-case

#+begin_quote
Match the regular expression limiting patterns without regard to letter
case.

#+end_quote

--basic-regexp

#+begin_quote
Consider the limiting patterns to be basic regular expressions; this is
the default.

#+end_quote

-E, --extended-regexp

#+begin_quote
Consider the limiting patterns to be extended regular expressions
instead of the default basic regular expressions.

#+end_quote

-F, --fixed-strings

#+begin_quote
Consider the limiting patterns to be fixed strings (don't interpret
pattern as a regular expression).

#+end_quote

-P, --perl-regexp

#+begin_quote
Consider the limiting patterns to be Perl-compatible regular
expressions.

Support for these types of regular expressions is an optional
compile-time dependency. If Git wasn't compiled with support for them
providing this option will cause it to die.

#+end_quote

--remove-empty

#+begin_quote
Stop when a given path disappears from the tree.

#+end_quote

--merges

#+begin_quote
Print only merge commits. This is exactly the same as *--min-parents=2*.

#+end_quote

--no-merges

#+begin_quote
Do not print commits with more than one parent. This is exactly the same
as *--max-parents=1*.

#+end_quote

--min-parents=<number>, --max-parents=<number>, --no-min-parents,
--no-max-parents

#+begin_quote
Show only commits which have at least (or at most) that many parent
commits. In particular, *--max-parents=1* is the same as *--no-merges*,
*--min-parents=2* is the same as *--merges*. *--max-parents=0* gives all
root commits and *--min-parents=3* all octopus merges.

*--no-min-parents* and *--no-max-parents* reset these limits (to no
limit) again. Equivalent forms are *--min-parents=0* (any commit has 0
or more parents) and *--max-parents=-1* (negative numbers denote no
upper limit).

#+end_quote

--first-parent

#+begin_quote
When finding commits to include, follow only the first parent commit
upon seeing a merge commit. This option can give a better overview when
viewing the evolution of a particular topic branch, because merges into
a topic branch tend to be only about adjusting to updated upstream from
time to time, and this option allows you to ignore the individual
commits brought in to your history by such a merge.

#+end_quote

--exclude-first-parent-only

#+begin_quote
When finding commits to exclude (with a /^/), follow only the first
parent commit upon seeing a merge commit. This can be used to find the
set of changes in a topic branch from the point where it diverged from
the remote branch, given that arbitrary merges can be valid topic branch
changes.

#+end_quote

--not

#+begin_quote
Reverses the meaning of the /^/ prefix (or lack thereof) for all
following revision specifiers, up to the next *--not*. When used on the
command line before --stdin, the revisions passed through stdin will not
be affected by it. Conversely, when passed via standard input, the
revisions passed on the command line will not be affected by it.

#+end_quote

--all

#+begin_quote
Pretend as if all the refs in *refs/*, along with *HEAD*, are listed on
the command line as /<commit>/.

#+end_quote

--branches[=<pattern>]

#+begin_quote
Pretend as if all the refs in *refs/heads* are listed on the command
line as /<commit>/. If /<pattern>/ is given, limit branches to ones
matching given shell glob. If pattern lacks /?/, /*/, or /[/, //*/ at
the end is implied.

#+end_quote

--tags[=<pattern>]

#+begin_quote
Pretend as if all the refs in *refs/tags* are listed on the command line
as /<commit>/. If /<pattern>/ is given, limit tags to ones matching
given shell glob. If pattern lacks /?/, /*/, or /[/, //*/ at the end is
implied.

#+end_quote

--remotes[=<pattern>]

#+begin_quote
Pretend as if all the refs in *refs/remotes* are listed on the command
line as /<commit>/. If /<pattern>/ is given, limit remote-tracking
branches to ones matching given shell glob. If pattern lacks /?/, /*/,
or /[/, //*/ at the end is implied.

#+end_quote

--glob=<glob-pattern>

#+begin_quote
Pretend as if all the refs matching shell glob /<glob-pattern>/ are
listed on the command line as /<commit>/. Leading /refs//, is
automatically prepended if missing. If pattern lacks /?/, /*/, or /[/,
//*/ at the end is implied.

#+end_quote

--exclude=<glob-pattern>

#+begin_quote
Do not include refs matching /<glob-pattern>/ that the next *--all*,
*--branches*, *--tags*, *--remotes*, or *--glob* would otherwise
consider. Repetitions of this option accumulate exclusion patterns up to
the next *--all*, *--branches*, *--tags*, *--remotes*, or *--glob*
option (other options or arguments do not clear accumulated patterns).

The patterns given should not begin with *refs/heads*, *refs/tags*, or
*refs/remotes* when applied to *--branches*, *--tags*, or *--remotes*,
respectively, and they must begin with *refs/* when applied to *--glob*
or *--all*. If a trailing //*/ is intended, it must be given explicitly.

#+end_quote

--exclude-hidden=[fetch|receive|uploadpack]

#+begin_quote
Do not include refs that would be hidden by *git-fetch*,
*git-receive-pack* or *git-upload-pack* by consulting the appropriate
*fetch.hideRefs*, *receive.hideRefs* or *uploadpack.hideRefs*
configuration along with *transfer.hideRefs* (see *git-config*(1)). This
option affects the next pseudo-ref option *--all* or *--glob* and is
cleared after processing them.

#+end_quote

--reflog

#+begin_quote
Pretend as if all objects mentioned by reflogs are listed on the command
line as *<commit>*.

#+end_quote

--alternate-refs

#+begin_quote
Pretend as if all objects mentioned as ref tips of alternate
repositories were listed on the command line. An alternate repository is
any repository whose object directory is specified in
*objects/info/alternates*. The set of included objects may be modified
by *core.alternateRefsCommand*, etc. See *git-config*(1).

#+end_quote

--single-worktree

#+begin_quote
By default, all working trees will be examined by the following options
when there are more than one (see *git-worktree*(1)): *--all*,
*--reflog* and *--indexed-objects*. This option forces them to examine
the current working tree only.

#+end_quote

--ignore-missing

#+begin_quote
Upon seeing an invalid object name in the input, pretend as if the bad
input was not given.

#+end_quote

--bisect

#+begin_quote
Pretend as if the bad bisection ref *refs/bisect/bad* was listed and as
if it was followed by *--not* and the good bisection refs
*refs/bisect/good-** on the command line.

#+end_quote

--stdin

#+begin_quote
In addition to getting arguments from the command line, read them from
standard input as well. This accepts commits and pseudo-options like
*--all* and *--glob=*. When a *--* separator is seen, the following
input is treated as paths and used to limit the result. Flags like
*--not* which are read via standard input are only respected for
arguments passed in the same way and will not influence any subsequent
command line arguments.

#+end_quote

--cherry-mark

#+begin_quote
Like *--cherry-pick* (see below) but mark equivalent commits with *=*
rather than omitting them, and inequivalent ones with *+*.

#+end_quote

--cherry-pick

#+begin_quote
Omit any commit that introduces the same change as another commit on the
“other side” when the set of commits are limited with symmetric
difference.

For example, if you have two branches, *A* and *B*, a usual way to list
all commits on only one side of them is with *--left-right* (see the
example below in the description of the *--left-right* option). However,
it shows the commits that were cherry-picked from the other branch (for
example, “3rd on b” may be cherry-picked from branch A). With this
option, such pairs of commits are excluded from the output.

#+end_quote

--left-only, --right-only

#+begin_quote
List only commits on the respective side of a symmetric difference, i.e.
only those which would be marked *<* resp. *>* by *--left-right*.

For example, *--cherry-pick --right-only A...B* omits those commits from
*B* which are in *A* or are patch-equivalent to a commit in *A*. In
other words, this lists the *+* commits from *git cherry A B*. More
precisely, *--cherry-pick --right-only --no-merges* gives the exact
list.

#+end_quote

--cherry

#+begin_quote
A synonym for *--right-only --cherry-mark --no-merges*; useful to limit
the output to the commits on our side and mark those that have been
applied to the other side of a forked history with *git log --cherry
upstream...mybranch*, similar to *git cherry upstream mybranch*.

#+end_quote

-g, --walk-reflogs

#+begin_quote
Instead of walking the commit ancestry chain, walk reflog entries from
the most recent one to older ones. When this option is used you cannot
specify commits to exclude (that is, /^commit/, /commit1..commit2/, and
/commit1...commit2/ notations cannot be used).

With *--pretty* format other than *oneline* and *reference* (for obvious
reasons), this causes the output to have two extra lines of information
taken from the reflog. The reflog designator in the output may be shown
as *ref@{<Nth>}* (where /<Nth>/ is the reverse-chronological index in
the reflog) or as *ref@{<timestamp>}* (with the /<timestamp>/ for that
entry), depending on a few rules:

#+begin_quote
1.

If the starting point is specified as *ref@{<Nth>}*, show the index
format.

#+end_quote

#+begin_quote
2.

If the starting point was specified as *ref@{now}*, show the timestamp
format.

#+end_quote

#+begin_quote
3.

If neither was used, but *--date* was given on the command line, show
the timestamp in the format requested by *--date*.

#+end_quote

#+begin_quote
4.

Otherwise, show the index format.

#+end_quote

Under *--pretty=oneline*, the commit message is prefixed with this
information on the same line. This option cannot be combined with
*--reverse*. See also *git-reflog*(1).

Under *--pretty=reference*, this information will not be shown at all.

#+end_quote

--merge

#+begin_quote
Show commits touching conflicted paths in the range *HEAD...<other>*,
where *<other>* is the first existing pseudoref in *MERGE_HEAD*,
*CHERRY_PICK_HEAD*, *REVERT_HEAD* or *REBASE_HEAD*. Only works when the
index has unmerged entries. This option can be used to show relevant
commits when resolving conflicts from a 3-way merge.

#+end_quote

--boundary

#+begin_quote
Output excluded boundary commits. Boundary commits are prefixed with
*-*.

#+end_quote

