public/man/man1/git-replay.1/index.html
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
Commit Limiting
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<p>Besides specifying a range of commits that should be listed using the
special notations explained in the description, additional commit
limiting may be applied.</p>
<p>
Using more options generally further limits the output (e.g.
<strong>–since=&lt;date1&gt;</strong> limits to commits newer than <strong>&lt;date1&gt;</strong>, and using it
with <strong>–grep=&lt;pattern&gt;</strong> further limits to commits whose log message has
a line that matches <strong>&lt;pattern&gt;</strong>), unless otherwise noted.</p>
<p>
Note that these are applied before commit ordering and formatting
options, such as <strong>–reverse</strong>.</p>
<p>
-&lt;number&gt;, -n &lt;number&gt;, –max-count=&lt;number&gt;</p>
<blockquote>
<p>Limit the number of commits to output.</p>
</blockquote>
<p>
–skip=&lt;number&gt;</p>
<blockquote>
<p>Skip <em>number</em> commits before starting to show the commit output.</p>
</blockquote>
<p>
–since=&lt;date&gt;, –after=&lt;date&gt;</p>
<blockquote>
<p>Show commits more recent than a specific date.</p>
</blockquote>
<p>
–since-as-filter=&lt;date&gt;</p>
<blockquote>
<p>Show all commits more recent than a specific date. This visits all
commits in the range, rather than stopping at the first commit which is
older than a specific date.</p>
</blockquote>
<p>
–until=&lt;date&gt;, –before=&lt;date&gt;</p>
<blockquote>
<p>Show commits older than a specific date.</p>
</blockquote>
<p>
–author=&lt;pattern&gt;, –committer=&lt;pattern&gt;</p>
<blockquote>
<p>Limit the commits output to ones with author/committer header lines that
match the specified pattern (regular expression). With more than one
<strong>–author=&lt;pattern&gt;</strong>, commits whose author matches any of the given
patterns are chosen (similarly for multiple <strong>–committer=&lt;pattern&gt;</strong>).</p>
</blockquote>
<p>
–grep-reflog=&lt;pattern&gt;</p>
<blockquote>
<p>Limit the commits output to ones with reflog entries that match the
specified pattern (regular expression). With more than one
<strong>–grep-reflog</strong>, commits whose reflog message matches any of the given
patterns are chosen. It is an error to use this option unless
<strong>–walk-reflogs</strong> is in use.</p>
</blockquote>
<p>
–grep=&lt;pattern&gt;</p>
<blockquote>
<p>Limit the commits output to ones with a log message that matches the
specified pattern (regular expression). With more than one
<strong>–grep=&lt;pattern&gt;</strong>, commits whose message matches any of the given
patterns are chosen (but see <strong>–all-match</strong>).</p>
<p>
When <strong>–notes</strong> is in effect, the message from the notes is matched as if
it were part of the log message.</p>
</blockquote>
<p>
–all-match</p>
<blockquote>
<p>Limit the commits output to ones that match all given <strong>–grep</strong>, instead
of ones that match at least one.</p>
</blockquote>
<p>
–invert-grep</p>
<blockquote>
<p>Limit the commits output to ones with a log message that do not match
the pattern specified with <strong>–grep=&lt;pattern&gt;</strong>.</p>
</blockquote>
<p>
-i, –regexp-ignore-case</p>
<blockquote>
<p>Match the regular expression limiting patterns without regard to letter
case.</p>
</blockquote>
<p>
–basic-regexp</p>
<blockquote>
<p>Consider the limiting patterns to be basic regular expressions; this is
the default.</p>
</blockquote>
<p>
-E, –extended-regexp</p>
<blockquote>
<p>Consider the limiting patterns to be extended regular expressions
instead of the default basic regular expressions.</p>
</blockquote>
<p>
-F, –fixed-strings</p>
<blockquote>
<p>Consider the limiting patterns to be fixed strings (don&#39;t interpret
pattern as a regular expression).</p>
</blockquote>
<p>
-P, –perl-regexp</p>
<blockquote>
<p>Consider the limiting patterns to be Perl-compatible regular
expressions.</p>
<p>
Support for these types of regular expressions is an optional
compile-time dependency. If Git wasn&#39;t compiled with support for them
providing this option will cause it to die.</p>
</blockquote>
<p>
–remove-empty</p>
<blockquote>
<p>Stop when a given path disappears from the tree.</p>
</blockquote>
<p>
–merges</p>
<blockquote>
<p>Print only merge commits. This is exactly the same as <strong>–min-parents=2</strong>.</p>
</blockquote>
<p>
–no-merges</p>
<blockquote>
<p>Do not print commits with more than one parent. This is exactly the same
as <strong>–max-parents=1</strong>.</p>
</blockquote>
<p>
–min-parents=&lt;number&gt;, –max-parents=&lt;number&gt;, –no-min-parents,
–no-max-parents</p>
<blockquote>
<p>Show only commits which have at least (or at most) that many parent
commits. In particular, <strong>–max-parents=1</strong> is the same as <strong>–no-merges</strong>,
<strong>–min-parents=2</strong> is the same as <strong>–merges</strong>. <strong>–max-parents=0</strong> gives all
root commits and <strong>–min-parents=3</strong> all octopus merges.</p>
<p>
<strong>–no-min-parents</strong> and <strong>–no-max-parents</strong> reset these limits (to no
limit) again. Equivalent forms are <strong>–min-parents=0</strong> (any commit has 0
or more parents) and <strong>–max-parents=-1</strong> (negative numbers denote no
upper limit).</p>
</blockquote>
<p>
–first-parent</p>
<blockquote>
<p>When finding commits to include, follow only the first parent commit
upon seeing a merge commit. This option can give a better overview when
viewing the evolution of a particular topic branch, because merges into
a topic branch tend to be only about adjusting to updated upstream from
time to time, and this option allows you to ignore the individual
commits brought in to your history by such a merge.</p>
</blockquote>
<p>
–exclude-first-parent-only</p>
<blockquote>
<p>When finding commits to exclude (with a <em>^</em>), follow only the first
parent commit upon seeing a merge commit. This can be used to find the
set of changes in a topic branch from the point where it diverged from
the remote branch, given that arbitrary merges can be valid topic branch
changes.</p>
</blockquote>
<p>
–not</p>
<blockquote>
<p>Reverses the meaning of the <em>^</em> prefix (or lack thereof) for all
following revision specifiers, up to the next <strong>–not</strong>. When used on the
command line before –stdin, the revisions passed through stdin will not
be affected by it. Conversely, when passed via standard input, the
revisions passed on the command line will not be affected by it.</p>
</blockquote>
<p>
–all</p>
<blockquote>
<p>Pretend as if all the refs in <strong>refs/</strong>, along with <strong>HEAD</strong>, are listed on
the command line as <em>&lt;commit&gt;</em>.</p>
</blockquote>
<p>
–branches[=&lt;pattern&gt;]</p>
<blockquote>
<p>Pretend as if all the refs in <strong>refs/heads</strong> are listed on the command
line as <em>&lt;commit&gt;</em>. If <em>&lt;pattern&gt;</em> is given, limit branches to ones
matching given shell glob. If pattern lacks <em>?</em>, <em>*</em>, or <em>[</em>, <em>/*</em> at
the end is implied.</p>
</blockquote>
<p>
–tags[=&lt;pattern&gt;]</p>
<blockquote>
<p>Pretend as if all the refs in <strong>refs/tags</strong> are listed on the command line
as <em>&lt;commit&gt;</em>. If <em>&lt;pattern&gt;</em> is given, limit tags to ones matching
given shell glob. If pattern lacks <em>?</em>, <em>*</em>, or <em>[</em>, <em>/*</em> at the end is
implied.</p>
</blockquote>
<p>
–remotes[=&lt;pattern&gt;]</p>
<blockquote>
<p>Pretend as if all the refs in <strong>refs/remotes</strong> are listed on the command
line as <em>&lt;commit&gt;</em>. If <em>&lt;pattern&gt;</em> is given, limit remote-tracking
branches to ones matching given shell glob. If pattern lacks <em>?</em>, <em>*</em>,
or <em>[</em>, <em>/*</em> at the end is implied.</p>
</blockquote>
<p>
–glob=&lt;glob-pattern&gt;</p>
<blockquote>
<p>Pretend as if all the refs matching shell glob <em>&lt;glob-pattern&gt;</em> are
listed on the command line as <em>&lt;commit&gt;</em>. Leading <em>refs/</em>, is
automatically prepended if missing. If pattern lacks <em>?</em>, <em>*</em>, or <em>[</em>,
<em>/*</em> at the end is implied.</p>
</blockquote>
<p>
–exclude=&lt;glob-pattern&gt;</p>
<blockquote>
<p>Do not include refs matching <em>&lt;glob-pattern&gt;</em> that the next <strong>–all</strong>,
<strong>–branches</strong>, <strong>–tags</strong>, <strong>–remotes</strong>, or <strong>–glob</strong> would otherwise
consider. Repetitions of this option accumulate exclusion patterns up to
the next <strong>–all</strong>, <strong>–branches</strong>, <strong>–tags</strong>, <strong>–remotes</strong>, or <strong>–glob</strong>
option (other options or arguments do not clear accumulated patterns).</p>
<p>
The patterns given should not begin with <strong>refs/heads</strong>, <strong>refs/tags</strong>, or
<strong>refs/remotes</strong> when applied to <strong>–branches</strong>, <strong>–tags</strong>, or <strong>–remotes</strong>,
respectively, and they must begin with <strong>refs/</strong> when applied to <strong>–glob</strong>
or <strong>–all</strong>. If a trailing <em>/*</em> is intended, it must be given explicitly.</p>
</blockquote>
<p>
–exclude-hidden=[fetch|receive|uploadpack]</p>
<blockquote>
<p>Do not include refs that would be hidden by <strong>git-fetch</strong>,
<strong>git-receive-pack</strong> or <strong>git-upload-pack</strong> by consulting the appropriate
<strong>fetch.hideRefs</strong>, <strong>receive.hideRefs</strong> or <strong>uploadpack.hideRefs</strong>
configuration along with <strong>transfer.hideRefs</strong> (see <strong>git-config*(1)). This
option affects the next pseudo-ref option *–all</strong> or <strong>–glob</strong> and is
cleared after processing them.</p>
</blockquote>
<p>
–reflog</p>
<blockquote>
<p>Pretend as if all objects mentioned by reflogs are listed on the command
line as <strong>&lt;commit&gt;</strong>.</p>
</blockquote>
<p>
–alternate-refs</p>
<blockquote>
<p>Pretend as if all objects mentioned as ref tips of alternate
repositories were listed on the command line. An alternate repository is
any repository whose object directory is specified in
<strong>objects/info/alternates</strong>. The set of included objects may be modified
by <strong>core.alternateRefsCommand</strong>, etc. See *git-config*(1).</p>
</blockquote>
<p>
–single-worktree</p>
<blockquote>
<p>By default, all working trees will be examined by the following options
when there are more than one (see <strong>git-worktree*(1)): *–all</strong>,
<strong>–reflog</strong> and <strong>–indexed-objects</strong>. This option forces them to examine
the current working tree only.</p>
</blockquote>
<p>
–ignore-missing</p>
<blockquote>
<p>Upon seeing an invalid object name in the input, pretend as if the bad
input was not given.</p>
</blockquote>
<p>
–bisect</p>
<blockquote>
<p>Pretend as if the bad bisection ref <strong>refs/bisect/bad</strong> was listed and as
if it was followed by <strong>–not</strong> and the good bisection refs
<strong>refs/bisect/good-*</strong> on the command line.</p>
</blockquote>
<p>
–stdin</p>
<blockquote>
<p>In addition to getting arguments from the command line, read them from
standard input as well. This accepts commits and pseudo-options like
<strong>–all</strong> and <strong>–glob=</strong>. When a <strong>–</strong> separator is seen, the following
input is treated as paths and used to limit the result. Flags like
<strong>–not</strong> which are read via standard input are only respected for
arguments passed in the same way and will not influence any subsequent
command line arguments.</p>
</blockquote>
<p>
–cherry-mark</p>
<blockquote>
<p>Like <strong>–cherry-pick</strong> (see below) but mark equivalent commits with <strong>=</strong>
rather than omitting them, and inequivalent ones with <strong>+</strong>.</p>
</blockquote>
<p>
–cherry-pick</p>
<blockquote>
<p>Omit any commit that introduces the same change as another commit on the
“other side” when the set of commits are limited with symmetric
difference.</p>
<p>
For example, if you have two branches, <strong>A</strong> and <strong>B</strong>, a usual way to list
all commits on only one side of them is with <strong>–left-right</strong> (see the
example below in the description of the <strong>–left-right</strong> option). However,
it shows the commits that were cherry-picked from the other branch (for
example, “3rd on b” may be cherry-picked from branch A). With this
option, such pairs of commits are excluded from the output.</p>
</blockquote>
<p>
–left-only, –right-only</p>
<blockquote>
<p>List only commits on the respective side of a symmetric difference, i.e.
only those which would be marked <strong>&lt;</strong> resp. <strong>&gt;</strong> by <strong>–left-right</strong>.</p>
<p>
For example, <strong>–cherry-pick –right-only A…B</strong> omits those commits from
<strong>B</strong> which are in <strong>A</strong> or are patch-equivalent to a commit in <strong>A</strong>. In
other words, this lists the <strong>+</strong> commits from <strong>git cherry A B</strong>. More
precisely, <strong>–cherry-pick –right-only –no-merges</strong> gives the exact
list.</p>
</blockquote>
<p>
–cherry</p>
<blockquote>
<p>A synonym for <strong>–right-only –cherry-mark –no-merges</strong>; useful to limit
the output to the commits on our side and mark those that have been
applied to the other side of a forked history with <strong>git log –cherry
upstream…mybranch</strong>, similar to <strong>git cherry upstream mybranch</strong>.</p>
</blockquote>
<p>
-g, –walk-reflogs</p>
<blockquote>
<p>Instead of walking the commit ancestry chain, walk reflog entries from
the most recent one to older ones. When this option is used you cannot
specify commits to exclude (that is, <em>^commit</em>, <em>commit1..commit2</em>, and
<em>commit1…commit2</em> notations cannot be used).</p>
<p>
With <strong>–pretty</strong> format other than <strong>oneline</strong> and <strong>reference</strong> (for obvious
reasons), this causes the output to have two extra lines of information
taken from the reflog. The reflog designator in the output may be shown
as <strong>ref@{&lt;Nth&gt;}</strong> (where <em>&lt;Nth&gt;</em> is the reverse-chronological index in
the reflog) or as <strong>ref@{&lt;timestamp&gt;}</strong> (with the <em>&lt;timestamp&gt;</em> for that
entry), depending on a few rules:</p>
<blockquote>
<ol>
<li></li>
</ol>
<p>If the starting point is specified as <strong>ref@{&lt;Nth&gt;}</strong>, show the index
format.</p>
</blockquote>
<blockquote>
<ol>
<li></li>
</ol>
<p>If the starting point was specified as <strong>ref@{now}</strong>, show the timestamp
format.</p>
</blockquote>
<blockquote>
<ol>
<li></li>
</ol>
<p>If neither was used, but <strong>–date</strong> was given on the command line, show
the timestamp in the format requested by <strong>–date</strong>.</p>
</blockquote>
<blockquote>
<ol>
<li></li>
</ol>
<p>Otherwise, show the index format.</p>
</blockquote>
<p>
Under <strong>–pretty=oneline</strong>, the commit message is prefixed with this
information on the same line. This option cannot be combined with
<strong>–reverse</strong>. See also *git-reflog*(1).</p>
<p>
Under <strong>–pretty=reference</strong>, this information will not be shown at all.</p>
</blockquote>
<p>
–merge</p>
<blockquote>
<p>Show commits touching conflicted paths in the range <strong>HEAD…&lt;other&gt;</strong>,
where <strong>&lt;other&gt;</strong> is the first existing pseudoref in <strong>MERGE_HEAD</strong>,
<strong>CHERRY_PICK_HEAD</strong>, <strong>REVERT_HEAD</strong> or <strong>REBASE_HEAD</strong>. Only works when the
index has unmerged entries. This option can be used to show relevant
commits when resolving conflicts from a 3-way merge.</p>
</blockquote>
<p>
–boundary</p>
<blockquote>
<p>Output excluded boundary commits. Boundary commits are prefixed with
<strong>-</strong>.</p>
</blockquote>
</div>
</div>
