content/man/man1/git-replay.1.org
** History Simplification
Sometimes you are only interested in parts of the history, for example
the commits modifying a particular <path>. But there are two parts of
/History Simplification/, one part is selecting the commits and the
other is how to do it, as there are various strategies to simplify the
history.

The following options select the commits to be shown:

<paths>

#+begin_quote
Commits modifying the given <paths> are selected.

#+end_quote

--simplify-by-decoration

#+begin_quote
Commits that are referred by some branch or tag are selected.

#+end_quote

Note that extra commits can be shown to give a meaningful history.

The following options affect the way the simplification is performed:

Default mode

#+begin_quote
Simplifies the history to the simplest history explaining the final
state of the tree. Simplest because it prunes some side branches if the
end result is the same (i.e. merging branches with the same content)

#+end_quote

--show-pulls

#+begin_quote
Include all commits from the default mode, but also any merge commits
that are not TREESAME to the first parent but are TREESAME to a later
parent. This mode is helpful for showing the merge commits that "first
introduced" a change to a branch.

#+end_quote

--full-history

#+begin_quote
Same as the default mode, but does not prune some history.

#+end_quote

--dense

#+begin_quote
Only the selected commits are shown, plus some to have a meaningful
history.

#+end_quote

--sparse

#+begin_quote
All commits in the simplified history are shown.

#+end_quote

--simplify-merges

#+begin_quote
Additional option to *--full-history* to remove some needless merges
from the resulting history, as there are no selected commits
contributing to this merge.

#+end_quote

--ancestry-path[=<commit>]

#+begin_quote
When given a range of commits to display (e.g. /commit1..commit2/ or
/commit2 ^commit1/), only display commits in that range that are
ancestors of <commit>, descendants of <commit>, or <commit> itself. If
no commit is specified, use /commit1/ (the excluded part of the range)
as <commit>. Can be passed multiple times; if so, a commit is included
if it is any of the commits given or if it is an ancestor or descendant
of one of them.

#+end_quote

A more detailed explanation follows.

Suppose you specified *foo* as the <paths>. We shall call commits that
modify *foo* !TREESAME, and the rest TREESAME. (In a diff filtered for
*foo*, they look different and equal, respectively.)

In the following, we will always refer to the same example history to
illustrate the differences between simplification settings. We assume
that you are filtering for a file *foo* in this commit graph:

#+begin_quote
#+begin_example
          .-A---M---N---O---P---Q
         /     /   /   /   /   /
        I     B   C   D   E   Y
         \   /   /   /   /   /
          `-------------   X
#+end_example

#+end_quote

The horizontal line of history A---Q is taken to be the first parent of
each merge. The commits are:

#+begin_quote
·

*I* is the initial commit, in which *foo* exists with contents “asdf”,
and a file *quux* exists with contents “quux”. Initial commits are
compared to an empty tree, so *I* is !TREESAME.

#+end_quote

#+begin_quote
·

In *A*, *foo* contains just “foo”.

#+end_quote

#+begin_quote
·

*B* contains the same change as *A*. Its merge *M* is trivial and hence
TREESAME to all parents.

#+end_quote

#+begin_quote
·

*C* does not change *foo*, but its merge *N* changes it to “foobar”, so
it is not TREESAME to any parent.

#+end_quote

#+begin_quote
·

*D* sets *foo* to “baz”. Its merge *O* combines the strings from *N* and
*D* to “foobarbaz”; i.e., it is not TREESAME to any parent.

#+end_quote

#+begin_quote
·

*E* changes *quux* to “xyzzy”, and its merge *P* combines the strings to
“quux xyzzy”. *P* is TREESAME to *O*, but not to *E*.

#+end_quote

#+begin_quote
·

*X* is an independent root commit that added a new file *side*, and *Y*
modified it. *Y* is TREESAME to *X*. Its merge *Q* added *side* to *P*,
and *Q* is TREESAME to *P*, but not to *Y*.

#+end_quote

*rev-list* walks backwards through history, including or excluding
commits based on whether *--full-history* and/or parent rewriting (via
*--parents* or *--children*) are used. The following settings are
available.

Default mode

#+begin_quote
Commits are included if they are not TREESAME to any parent (though this
can be changed, see *--sparse* below). If the commit was a merge, and it
was TREESAME to one parent, follow only that parent. (Even if there are
several TREESAME parents, follow only one of them.) Otherwise, follow
all parents.

This results in:

#+begin_quote
#+begin_example
          .-A---N---O
         /     /   /
        I---------D
#+end_example

#+end_quote

Note how the rule to only follow the TREESAME parent, if one is
available, removed *B* from consideration entirely. *C* was considered
via *N*, but is TREESAME. Root commits are compared to an empty tree, so
*I* is !TREESAME.

Parent/child relations are only visible with *--parents*, but that does
not affect the commits selected in default mode, so we have shown the
parent lines.

#+end_quote

--full-history without parent rewriting

#+begin_quote
This mode differs from the default in one point: always follow all
parents of a merge, even if it is TREESAME to one of them. Even if more
than one side of the merge has commits that are included, this does not
imply that the merge itself is! In the example, we get

#+begin_quote
#+begin_example
        I  A  B  N  D  O  P  Q
#+end_example

#+end_quote

*M* was excluded because it is TREESAME to both parents. *E*, *C* and
*B* were all walked, but only *B* was !TREESAME, so the others do not
appear.

Note that without parent rewriting, it is not really possible to talk
about the parent/child relationships between the commits, so we show
them disconnected.

#+end_quote

--full-history with parent rewriting

#+begin_quote
Ordinary commits are only included if they are !TREESAME (though this
can be changed, see *--sparse* below).

Merges are always included. However, their parent list is rewritten:
Along each parent, prune away commits that are not included themselves.
This results in

#+begin_quote
#+begin_example
          .-A---M---N---O---P---Q
         /     /   /   /   /
        I     B   /   D   /
         \   /   /   /   /
          `-------------
#+end_example

#+end_quote

Compare to *--full-history* without rewriting above. Note that *E* was
pruned away because it is TREESAME, but the parent list of P was
rewritten to contain *E*s parent *I*. The same happened for *C* and *N*,
and *X*, *Y* and *Q*.

#+end_quote

In addition to the above settings, you can change whether TREESAME
affects inclusion:

--dense

#+begin_quote
Commits that are walked are included if they are not TREESAME to any
parent.

#+end_quote

--sparse

#+begin_quote
All commits that are walked are included.

Note that without *--full-history*, this still simplifies merges: if one
of the parents is TREESAME, we follow only that one, so the other sides
of the merge are never walked.

#+end_quote

--simplify-merges

#+begin_quote
First, build a history graph in the same way that *--full-history* with
parent rewriting does (see above).

Then simplify each commit *C* to its replacement *C* in the final
history according to the following rules:

#+begin_quote
·

Set *C* to *C*.

#+end_quote

#+begin_quote
·

Replace each parent *P* of *C* with its simplification *P*. In the
process, drop parents that are ancestors of other parents or that are
root commits TREESAME to an empty tree, and remove duplicates, but take
care to never drop all parents that we are TREESAME to.

#+end_quote

#+begin_quote
·

If after this parent rewriting, *C* is a root or merge commit (has zero
or >1 parents), a boundary commit, or !TREESAME, it remains. Otherwise,
it is replaced with its only parent.

#+end_quote

The effect of this is best shown by way of comparing to *--full-history*
with parent rewriting. The example turns into:

#+begin_quote
#+begin_example
          .-A---M---N---O
         /     /       /
        I     B       D
         \   /       /
          `---------
#+end_example

#+end_quote

Note the major differences in *N*, *P*, and *Q* over *--full-history*:

#+begin_quote
·

*N*s parent list had *I* removed, because it is an ancestor of the other
parent *M*. Still, *N* remained because it is !TREESAME.

#+end_quote

#+begin_quote
·

*P*s parent list similarly had *I* removed. *P* was then removed
completely, because it had one parent and is TREESAME.

#+end_quote

#+begin_quote
·

*Q*s parent list had *Y* simplified to *X*. *X* was then removed,
because it was a TREESAME root. *Q* was then removed completely, because
it had one parent and is TREESAME.

#+end_quote

#+end_quote

There is another simplification mode available:

--ancestry-path[=<commit>]

#+begin_quote
Limit the displayed commits to those which are an ancestor of <commit>,
or which are a descendant of <commit>, or are <commit> itself.

As an example use case, consider the following commit history:

#+begin_quote
#+begin_example
            D---E-------F
           /     \       \
          B---C---G---H---I---J
         /                     \
        A-------K---------------L--M
#+end_example

#+end_quote

A regular /D..M/ computes the set of commits that are ancestors of *M*,
but excludes the ones that are ancestors of *D*. This is useful to see
what happened to the history leading to *M* since *D*, in the sense that
“what does *M* have that did not exist in *D*”. The result in this
example would be all the commits, except *A* and *B* (and *D* itself, of
course).

When we want to find out what commits in *M* are contaminated with the
bug introduced by *D* and need fixing, however, we might want to view
only the subset of /D..M/ that are actually descendants of *D*, i.e.
excluding *C* and *K*. This is exactly what the *--ancestry-path* option
does. Applied to the /D..M/ range, it results in:

#+begin_quote
#+begin_example
                E-------F
                 \       \
                  G---H---I---J
                               \
                                L--M
#+end_example

#+end_quote

We can also use *--ancestry-path=D* instead of *--ancestry-path* which
means the same thing when applied to the /D..M/ range but is just more
explicit.

If we instead are interested in a given topic within this range, and all
commits affected by that topic, we may only want to view the subset of
*D..M* which contain that topic in their ancestry path. So, using
*--ancestry-path=H D..M* for example would result in:

#+begin_quote
#+begin_example
                E
                 \
                  G---H---I---J
                               \
                                L--M
#+end_example

#+end_quote

Whereas *--ancestry-path=K D..M* would result in

#+begin_quote
#+begin_example
                K---------------L--M
#+end_example

#+end_quote

#+end_quote

Before discussing another option, *--show-pulls*, we need to create a
new example history.

A common problem users face when looking at simplified history is that a
commit they know changed a file somehow does not appear in the file's
simplified history. Let's demonstrate a new example and show how options
such as *--full-history* and *--simplify-merges* works in that case:

#+begin_quote
#+begin_example
          .-A---M-----C--N---O---P
         /     / \  \  \/   /   /
        I     B   \  R-`-Z   /
         \   /     \/         /
          \ /      /\        /
           `---X--  `---Y--
#+end_example

#+end_quote

For this example, suppose *I* created *file.txt* which was modified by
*A*, *B*, and *X* in different ways. The single-parent commits *C*, *Z*,
and *Y* do not change *file.txt*. The merge commit *M* was created by
resolving the merge conflict to include both changes from *A* and *B*
and hence is not TREESAME to either. The merge commit *R*, however, was
created by ignoring the contents of *file.txt* at *M* and taking only
the contents of *file.txt* at *X*. Hence, *R* is TREESAME to *X* but not
*M*. Finally, the natural merge resolution to create *N* is to take the
contents of *file.txt* at *R*, so *N* is TREESAME to *R* but not *C*.
The merge commits *O* and *P* are TREESAME to their first parents, but
not to their second parents, *Z* and *Y* respectively.

When using the default mode, *N* and *R* both have a TREESAME parent, so
those edges are walked and the others are ignored. The resulting history
graph is:

#+begin_quote
#+begin_example
        I---X
#+end_example

#+end_quote

When using *--full-history*, Git walks every edge. This will discover
the commits *A* and *B* and the merge *M*, but also will reveal the
merge commits *O* and *P*. With parent rewriting, the resulting graph
is:

#+begin_quote
#+begin_example
          .-A---M--------N---O---P
         /     / \  \  \/   /   /
        I     B   \  R-`--   /
         \   /     \/         /
          \ /      /\        /
           `---X--  `------
#+end_example

#+end_quote

Here, the merge commits *O* and *P* contribute extra noise, as they did
not actually contribute a change to *file.txt*. They only merged a topic
that was based on an older version of *file.txt*. This is a common issue
in repositories using a workflow where many contributors work in
parallel and merge their topic branches along a single trunk: many
unrelated merges appear in the *--full-history* results.

When using the *--simplify-merges* option, the commits *O* and *P*
disappear from the results. This is because the rewritten second parents
of *O* and *P* are reachable from their first parents. Those edges are
removed and then the commits look like single-parent commits that are
TREESAME to their parent. This also happens to the commit *N*, resulting
in a history view as follows:

#+begin_quote
#+begin_example
          .-A---M--.
         /     /    \
        I     B      R
         \   /      /
          \ /      /
           `---X--
#+end_example

#+end_quote

In this view, we see all of the important single-parent changes from
*A*, *B*, and *X*. We also see the carefully-resolved merge *M* and the
not-so-carefully-resolved merge *R*. This is usually enough information
to determine why the commits *A* and *B* "disappeared" from history in
the default view. However, there are a few issues with this approach.

The first issue is performance. Unlike any previous option, the
*--simplify-merges* option requires walking the entire commit history
before returning a single result. This can make the option difficult to
use for very large repositories.

The second issue is one of auditing. When many contributors are working
on the same repository, it is important which merge commits introduced a
change into an important branch. The problematic merge *R* above is not
likely to be the merge commit that was used to merge into an important
branch. Instead, the merge *N* was used to merge *R* and *X* into the
important branch. This commit may have information about why the change
*X* came to override the changes from *A* and *B* in its commit message.

--show-pulls

#+begin_quote
In addition to the commits shown in the default history, show each merge
commit that is not TREESAME to its first parent but is TREESAME to a
later parent.

When a merge commit is included by *--show-pulls*, the merge is treated
as if it "pulled" the change from another branch. When using
*--show-pulls* on this example (and no other options) the resulting
graph is:

#+begin_quote
#+begin_example
        I---X---R---N
#+end_example

#+end_quote

Here, the merge commits *R* and *N* are included because they pulled the
commits *X* and *R* into the base branch, respectively. These merges are
the reason the commits *A* and *B* do not appear in the default history.

When *--show-pulls* is paired with *--simplify-merges*, the graph
includes all of the necessary information:

#+begin_quote
#+begin_example
          .-A---M--.   N
         /     /    \ /
        I     B      R
         \   /      /
          \ /      /
           `---X--
#+end_example

#+end_quote

Notice that since *M* is reachable from *R*, the edge from *N* to *M*
was simplified away. However, *N* still appears in the history as an
important commit because it "pulled" the change *R* into the main
branch.

#+end_quote

The *--simplify-by-decoration* option allows you to view only the big
picture of the topology of the history, by omitting commits that are not
referenced by tags. Commits are marked as !TREESAME (in other words,
kept after history simplification rules described above) if (1) they are
referenced by tags, or (2) they change the contents of the paths given
on the command line. All other commits are marked as TREESAME (subject
to be simplified away).

