public/man/man1/git-replay.1/index.html
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
History Simplification
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<p>Sometimes you are only interested in parts of the history, for example
the commits modifying a particular &lt;path&gt;. But there are two parts of
<em>History Simplification</em>, one part is selecting the commits and the
other is how to do it, as there are various strategies to simplify the
history.</p>
<p>
The following options select the commits to be shown:</p>
<p>
&lt;paths&gt;</p>
<blockquote>
<p>Commits modifying the given &lt;paths&gt; are selected.</p>
</blockquote>
<p>
–simplify-by-decoration</p>
<blockquote>
<p>Commits that are referred by some branch or tag are selected.</p>
</blockquote>
<p>
Note that extra commits can be shown to give a meaningful history.</p>
<p>
The following options affect the way the simplification is performed:</p>
<p>
Default mode</p>
<blockquote>
<p>Simplifies the history to the simplest history explaining the final
state of the tree. Simplest because it prunes some side branches if the
end result is the same (i.e. merging branches with the same content)</p>
</blockquote>
<p>
–show-pulls</p>
<blockquote>
<p>Include all commits from the default mode, but also any merge commits
that are not TREESAME to the first parent but are TREESAME to a later
parent. This mode is helpful for showing the merge commits that &#34;first
introduced&#34; a change to a branch.</p>
</blockquote>
<p>
–full-history</p>
<blockquote>
<p>Same as the default mode, but does not prune some history.</p>
</blockquote>
<p>
–dense</p>
<blockquote>
<p>Only the selected commits are shown, plus some to have a meaningful
history.</p>
</blockquote>
<p>
–sparse</p>
<blockquote>
<p>All commits in the simplified history are shown.</p>
</blockquote>
<p>
–simplify-merges</p>
<blockquote>
<p>Additional option to <strong>–full-history</strong> to remove some needless merges
from the resulting history, as there are no selected commits
contributing to this merge.</p>
</blockquote>
<p>
–ancestry-path[=&lt;commit&gt;]</p>
<blockquote>
<p>When given a range of commits to display (e.g. <em>commit1..commit2</em> or
<em>commit2 ^commit1</em>), only display commits in that range that are
ancestors of &lt;commit&gt;, descendants of &lt;commit&gt;, or &lt;commit&gt; itself. If
no commit is specified, use <em>commit1</em> (the excluded part of the range)
as &lt;commit&gt;. Can be passed multiple times; if so, a commit is included
if it is any of the commits given or if it is an ancestor or descendant
of one of them.</p>
</blockquote>
<p>
A more detailed explanation follows.</p>
<p>
Suppose you specified <strong>foo</strong> as the &lt;paths&gt;. We shall call commits that
modify <strong>foo</strong> !TREESAME, and the rest TREESAME. (In a diff filtered for
<strong>foo</strong>, they look different and equal, respectively.)</p>
<p>
In the following, we will always refer to the same example history to
illustrate the differences between simplification settings. We assume
that you are filtering for a file <strong>foo</strong> in this commit graph:</p>
<blockquote>
<pre class="example">
          .-A---M---N---O---P---Q
         /     /   /   /   /   /
        I     B   C   D   E   Y
         \   /   /   /   /   /
          `-------------   X
</pre>
</blockquote>
<p>
The horizontal line of history A—Q is taken to be the first parent of
each merge. The commits are:</p>
<blockquote>
<p>·</p>
<p>
<strong>I</strong> is the initial commit, in which <strong>foo</strong> exists with contents “asdf”,
and a file <strong>quux</strong> exists with contents “quux”. Initial commits are
compared to an empty tree, so <strong>I</strong> is !TREESAME.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
In <strong>A</strong>, <strong>foo</strong> contains just “foo”.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
<strong>B</strong> contains the same change as <strong>A</strong>. Its merge <strong>M</strong> is trivial and hence
TREESAME to all parents.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
<strong>C</strong> does not change <strong>foo</strong>, but its merge <strong>N</strong> changes it to “foobar”, so
it is not TREESAME to any parent.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
<strong>D</strong> sets <strong>foo</strong> to “baz”. Its merge <strong>O</strong> combines the strings from <strong>N</strong> and
<strong>D</strong> to “foobarbaz”; i.e., it is not TREESAME to any parent.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
<strong>E</strong> changes <strong>quux</strong> to “xyzzy”, and its merge <strong>P</strong> combines the strings to
“quux xyzzy”. <strong>P</strong> is TREESAME to <strong>O</strong>, but not to <strong>E</strong>.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
<strong>X</strong> is an independent root commit that added a new file <strong>side</strong>, and <strong>Y</strong>
modified it. <strong>Y</strong> is TREESAME to <strong>X</strong>. Its merge <strong>Q</strong> added <strong>side</strong> to <strong>P</strong>,
and <strong>Q</strong> is TREESAME to <strong>P</strong>, but not to <strong>Y</strong>.</p>
</blockquote>
<p>
<strong>rev-list</strong> walks backwards through history, including or excluding
commits based on whether <strong>–full-history</strong> and/or parent rewriting (via
<strong>–parents</strong> or <strong>–children</strong>) are used. The following settings are
available.</p>
<p>
Default mode</p>
<blockquote>
<p>Commits are included if they are not TREESAME to any parent (though this
can be changed, see <strong>–sparse</strong> below). If the commit was a merge, and it
was TREESAME to one parent, follow only that parent. (Even if there are
several TREESAME parents, follow only one of them.) Otherwise, follow
all parents.</p>
<p>
This results in:</p>
<blockquote>
<pre class="example">
          .-A---N---O
         /     /   /
        I---------D
</pre>
</blockquote>
<p>
Note how the rule to only follow the TREESAME parent, if one is
available, removed <strong>B</strong> from consideration entirely. <strong>C</strong> was considered
via <strong>N</strong>, but is TREESAME. Root commits are compared to an empty tree, so
<strong>I</strong> is !TREESAME.</p>
<p>
Parent/child relations are only visible with <strong>–parents</strong>, but that does
not affect the commits selected in default mode, so we have shown the
parent lines.</p>
</blockquote>
<p>
–full-history without parent rewriting</p>
<blockquote>
<p>This mode differs from the default in one point: always follow all
parents of a merge, even if it is TREESAME to one of them. Even if more
than one side of the merge has commits that are included, this does not
imply that the merge itself is! In the example, we get</p>
<blockquote>
<pre class="example">
        I  A  B  N  D  O  P  Q
</pre>
</blockquote>
<p>
<strong>M</strong> was excluded because it is TREESAME to both parents. <strong>E</strong>, <strong>C</strong> and
<strong>B</strong> were all walked, but only <strong>B</strong> was !TREESAME, so the others do not
appear.</p>
<p>
Note that without parent rewriting, it is not really possible to talk
about the parent/child relationships between the commits, so we show
them disconnected.</p>
</blockquote>
<p>
–full-history with parent rewriting</p>
<blockquote>
<p>Ordinary commits are only included if they are !TREESAME (though this
can be changed, see <strong>–sparse</strong> below).</p>
<p>
Merges are always included. However, their parent list is rewritten:
Along each parent, prune away commits that are not included themselves.
This results in</p>
<blockquote>
<pre class="example">
          .-A---M---N---O---P---Q
         /     /   /   /   /
        I     B   /   D   /
         \   /   /   /   /
          `-------------
</pre>
</blockquote>
<p>
Compare to <strong>–full-history</strong> without rewriting above. Note that <strong>E</strong> was
pruned away because it is TREESAME, but the parent list of P was
rewritten to contain <strong>E*s parent *I</strong>. The same happened for <strong>C</strong> and <strong>N</strong>,
and <strong>X</strong>, <strong>Y</strong> and <strong>Q</strong>.</p>
</blockquote>
<p>
In addition to the above settings, you can change whether TREESAME
affects inclusion:</p>
<p>
–dense</p>
<blockquote>
<p>Commits that are walked are included if they are not TREESAME to any
parent.</p>
</blockquote>
<p>
–sparse</p>
<blockquote>
<p>All commits that are walked are included.</p>
<p>
Note that without <strong>–full-history</strong>, this still simplifies merges: if one
of the parents is TREESAME, we follow only that one, so the other sides
of the merge are never walked.</p>
</blockquote>
<p>
–simplify-merges</p>
<blockquote>
<p>First, build a history graph in the same way that <strong>–full-history</strong> with
parent rewriting does (see above).</p>
<p>
Then simplify each commit <strong>C</strong> to its replacement <strong>C</strong> in the final
history according to the following rules:</p>
<blockquote>
<p>·</p>
<p>
Set <strong>C</strong> to <strong>C</strong>.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
Replace each parent <strong>P</strong> of <strong>C</strong> with its simplification <strong>P</strong>. In the
process, drop parents that are ancestors of other parents or that are
root commits TREESAME to an empty tree, and remove duplicates, but take
care to never drop all parents that we are TREESAME to.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
If after this parent rewriting, <strong>C</strong> is a root or merge commit (has zero
or &gt;1 parents), a boundary commit, or !TREESAME, it remains. Otherwise,
it is replaced with its only parent.</p>
</blockquote>
<p>
The effect of this is best shown by way of comparing to <strong>–full-history</strong>
with parent rewriting. The example turns into:</p>
<blockquote>
<pre class="example">
          .-A---M---N---O
         /     /       /
        I     B       D
         \   /       /
          `---------
</pre>
</blockquote>
<p>
Note the major differences in <strong>N</strong>, <strong>P</strong>, and <strong>Q</strong> over <strong>–full-history</strong>:</p>
<blockquote>
<p>·</p>
<p>
<strong>N*s parent list had *I</strong> removed, because it is an ancestor of the other
parent <strong>M</strong>. Still, <strong>N</strong> remained because it is !TREESAME.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
<strong>P*s parent list similarly had *I</strong> removed. <strong>P</strong> was then removed
completely, because it had one parent and is TREESAME.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
<strong>Q*s parent list had *Y</strong> simplified to <strong>X</strong>. <strong>X</strong> was then removed,
because it was a TREESAME root. <strong>Q</strong> was then removed completely, because
it had one parent and is TREESAME.</p>
</blockquote>
</blockquote>
<p>
There is another simplification mode available:</p>
<p>
–ancestry-path[=&lt;commit&gt;]</p>
<blockquote>
<p>Limit the displayed commits to those which are an ancestor of &lt;commit&gt;,
or which are a descendant of &lt;commit&gt;, or are &lt;commit&gt; itself.</p>
<p>
As an example use case, consider the following commit history:</p>
<blockquote>
<pre class="example">
            D---E-------F
           /     \       \
          B---C---G---H---I---J
         /                     \
        A-------K---------------L--M
</pre>
</blockquote>
<p>
A regular <em>D..M</em> computes the set of commits that are ancestors of <strong>M</strong>,
but excludes the ones that are ancestors of <strong>D</strong>. This is useful to see
what happened to the history leading to <strong>M</strong> since <strong>D</strong>, in the sense that
“what does <strong>M</strong> have that did not exist in <strong>D*”. The result in this
example would be all the commits, except *A</strong> and <strong>B</strong> (and <strong>D</strong> itself, of
course).</p>
<p>
When we want to find out what commits in <strong>M</strong> are contaminated with the
bug introduced by <strong>D</strong> and need fixing, however, we might want to view
only the subset of <em>D..M</em> that are actually descendants of <strong>D</strong>, i.e.
excluding <strong>C</strong> and <strong>K</strong>. This is exactly what the <strong>–ancestry-path</strong> option
does. Applied to the <em>D..M</em> range, it results in:</p>
<blockquote>
<pre class="example">
                E-------F
                 \       \
                  G---H---I---J
                               \
                                L--M
</pre>
</blockquote>
<p>
We can also use <strong>–ancestry-path=D</strong> instead of <strong>–ancestry-path</strong> which
means the same thing when applied to the <em>D..M</em> range but is just more
explicit.</p>
<p>
If we instead are interested in a given topic within this range, and all
commits affected by that topic, we may only want to view the subset of
<strong>D..M</strong> which contain that topic in their ancestry path. So, using
<strong>–ancestry-path=H D..M</strong> for example would result in:</p>
<blockquote>
<pre class="example">
                E
                 \
                  G---H---I---J
                               \
                                L--M
</pre>
</blockquote>
<p>
Whereas <strong>–ancestry-path=K D..M</strong> would result in</p>
<blockquote>
<pre class="example">
                K---------------L--M
</pre>
</blockquote>
</blockquote>
<p>
Before discussing another option, <strong>–show-pulls</strong>, we need to create a
new example history.</p>
<p>
A common problem users face when looking at simplified history is that a
commit they know changed a file somehow does not appear in the file&#39;s
simplified history. Let&#39;s demonstrate a new example and show how options
such as <strong>–full-history</strong> and <strong>–simplify-merges</strong> works in that case:</p>
<blockquote>
<pre class="example">
          .-A---M-----C--N---O---P
         /     / \  \  \/   /   /
        I     B   \  R-`-Z   /
         \   /     \/         /
          \ /      /\        /
           `---X--  `---Y--
</pre>
</blockquote>
<p>
For this example, suppose <strong>I</strong> created <strong>file.txt</strong> which was modified by
<strong>A</strong>, <strong>B</strong>, and <strong>X</strong> in different ways. The single-parent commits <strong>C</strong>, <strong>Z</strong>,
and <strong>Y</strong> do not change <strong>file.txt</strong>. The merge commit <strong>M</strong> was created by
resolving the merge conflict to include both changes from <strong>A</strong> and <strong>B</strong>
and hence is not TREESAME to either. The merge commit <strong>R</strong>, however, was
created by ignoring the contents of <strong>file.txt</strong> at <strong>M</strong> and taking only
the contents of <strong>file.txt</strong> at <strong>X</strong>. Hence, <strong>R</strong> is TREESAME to <strong>X</strong> but not
<strong>M</strong>. Finally, the natural merge resolution to create <strong>N</strong> is to take the
contents of <strong>file.txt</strong> at <strong>R</strong>, so <strong>N</strong> is TREESAME to <strong>R</strong> but not <strong>C</strong>.
The merge commits <strong>O</strong> and <strong>P</strong> are TREESAME to their first parents, but
not to their second parents, <strong>Z</strong> and <strong>Y</strong> respectively.</p>
<p>
When using the default mode, <strong>N</strong> and <strong>R</strong> both have a TREESAME parent, so
those edges are walked and the others are ignored. The resulting history
graph is:</p>
<blockquote>
<pre class="example">
        I---X
</pre>
</blockquote>
<p>
When using <strong>–full-history</strong>, Git walks every edge. This will discover
the commits <strong>A</strong> and <strong>B</strong> and the merge <strong>M</strong>, but also will reveal the
merge commits <strong>O</strong> and <strong>P</strong>. With parent rewriting, the resulting graph
is:</p>
<blockquote>
<pre class="example">
          .-A---M--------N---O---P
         /     / \  \  \/   /   /
        I     B   \  R-`--   /
         \   /     \/         /
          \ /      /\        /
           `---X--  `------
</pre>
</blockquote>
<p>
Here, the merge commits <strong>O</strong> and <strong>P</strong> contribute extra noise, as they did
not actually contribute a change to <strong>file.txt</strong>. They only merged a topic
that was based on an older version of <strong>file.txt</strong>. This is a common issue
in repositories using a workflow where many contributors work in
parallel and merge their topic branches along a single trunk: many
unrelated merges appear in the <strong>–full-history</strong> results.</p>
<p>
When using the <strong>–simplify-merges</strong> option, the commits <strong>O</strong> and <strong>P</strong>
disappear from the results. This is because the rewritten second parents
of <strong>O</strong> and <strong>P</strong> are reachable from their first parents. Those edges are
removed and then the commits look like single-parent commits that are
TREESAME to their parent. This also happens to the commit <strong>N</strong>, resulting
in a history view as follows:</p>
<blockquote>
<pre class="example">
          .-A---M--.
         /     /    \
        I     B      R
         \   /      /
          \ /      /
           `---X--
</pre>
</blockquote>
<p>
In this view, we see all of the important single-parent changes from
<strong>A</strong>, <strong>B</strong>, and <strong>X</strong>. We also see the carefully-resolved merge <strong>M</strong> and the
not-so-carefully-resolved merge <strong>R</strong>. This is usually enough information
to determine why the commits <strong>A</strong> and <strong>B</strong> &#34;disappeared&#34; from history in
the default view. However, there are a few issues with this approach.</p>
<p>
The first issue is performance. Unlike any previous option, the
<strong>–simplify-merges</strong> option requires walking the entire commit history
before returning a single result. This can make the option difficult to
use for very large repositories.</p>
<p>
The second issue is one of auditing. When many contributors are working
on the same repository, it is important which merge commits introduced a
change into an important branch. The problematic merge <strong>R</strong> above is not
likely to be the merge commit that was used to merge into an important
branch. Instead, the merge <strong>N</strong> was used to merge <strong>R</strong> and <strong>X</strong> into the
important branch. This commit may have information about why the change
<strong>X</strong> came to override the changes from <strong>A</strong> and <strong>B</strong> in its commit message.</p>
<p>
–show-pulls</p>
<blockquote>
<p>In addition to the commits shown in the default history, show each merge
commit that is not TREESAME to its first parent but is TREESAME to a
later parent.</p>
<p>
When a merge commit is included by <strong>–show-pulls</strong>, the merge is treated
as if it &#34;pulled&#34; the change from another branch. When using
<strong>–show-pulls</strong> on this example (and no other options) the resulting
graph is:</p>
<blockquote>
<pre class="example">
        I---X---R---N
</pre>
</blockquote>
<p>
Here, the merge commits <strong>R</strong> and <strong>N</strong> are included because they pulled the
commits <strong>X</strong> and <strong>R</strong> into the base branch, respectively. These merges are
the reason the commits <strong>A</strong> and <strong>B</strong> do not appear in the default history.</p>
<p>
When <strong>–show-pulls</strong> is paired with <strong>–simplify-merges</strong>, the graph
includes all of the necessary information:</p>
<blockquote>
<pre class="example">
          .-A---M--.   N
         /     /    \ /
        I     B      R
         \   /      /
          \ /      /
           `---X--
</pre>
</blockquote>
<p>
Notice that since <strong>M</strong> is reachable from <strong>R</strong>, the edge from <strong>N</strong> to <strong>M</strong>
was simplified away. However, <strong>N</strong> still appears in the history as an
important commit because it &#34;pulled&#34; the change <strong>R</strong> into the main
branch.</p>
</blockquote>
<p>
The <strong>–simplify-by-decoration</strong> option allows you to view only the big
picture of the topology of the history, by omitting commits that are not
referenced by tags. Commits are marked as !TREESAME (in other words,
kept after history simplification rules described above) if (1) they are
referenced by tags, or (2) they change the contents of the paths given
on the command line. All other commits are marked as TREESAME (subject
to be simplified away).</p>
</div>
</div>
