content/man/man1/git-replay.1.org
** Commit Ordering
By default, the commits are shown in reverse chronological order.

--date-order

#+begin_quote
Show no parents before all of its children are shown, but otherwise show
commits in the commit timestamp order.

#+end_quote

--author-date-order

#+begin_quote
Show no parents before all of its children are shown, but otherwise show
commits in the author timestamp order.

#+end_quote

--topo-order

#+begin_quote
Show no parents before all of its children are shown, and avoid showing
commits on multiple lines of history intermixed.

For example, in a commit history like this:

#+begin_quote
#+begin_example
    ---1----2----4----7
        \              \
         3----5----6----8---
#+end_example

#+end_quote

where the numbers denote the order of commit timestamps, *git rev-list*
and friends with *--date-order* show the commits in the timestamp order:
8 7 6 5 4 3 2 1.

With *--topo-order*, they would show 8 6 5 3 7 4 2 1 (or 8 7 4 2 6 5 3
1); some older commits are shown before newer ones in order to avoid
showing the commits from two parallel development track mixed together.

#+end_quote

--reverse

#+begin_quote
Output the commits chosen to be shown (see Commit Limiting section
above) in reverse order. Cannot be combined with *--walk-reflogs*.

#+end_quote

** Object Traversal
These options are mostly targeted for packing of Git repositories.

--no-walk[=(sorted|unsorted)]

#+begin_quote
Only show the given commits, but do not traverse their ancestors. This
has no effect if a range is specified. If the argument *unsorted* is
given, the commits are shown in the order they were given on the command
line. Otherwise (if *sorted* or no argument was given), the commits are
shown in reverse chronological order by commit time. Cannot be combined
with *--graph*.

#+end_quote

--do-walk

#+begin_quote
Overrides a previous *--no-walk*.

#+end_quote

