public/man/man1/git-replay.1/index.html
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
Commit Ordering
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<p>By default, the commits are shown in reverse chronological order.</p>
<p>
–date-order</p>
<blockquote>
<p>Show no parents before all of its children are shown, but otherwise show
commits in the commit timestamp order.</p>
</blockquote>
<p>
–author-date-order</p>
<blockquote>
<p>Show no parents before all of its children are shown, but otherwise show
commits in the author timestamp order.</p>
</blockquote>
<p>
–topo-order</p>
<blockquote>
<p>Show no parents before all of its children are shown, and avoid showing
commits on multiple lines of history intermixed.</p>
<p>
For example, in a commit history like this:</p>
<blockquote>
<pre class="example">
    ---1----2----4----7
        \              \
         3----5----6----8---
</pre>
</blockquote>
<p>
where the numbers denote the order of commit timestamps, <strong>git rev-list</strong>
and friends with <strong>–date-order</strong> show the commits in the timestamp order:
8 7 6 5 4 3 2 1.</p>
<p>
With <strong>–topo-order</strong>, they would show 8 6 5 3 7 4 2 1 (or 8 7 4 2 6 5 3
1); some older commits are shown before newer ones in order to avoid
showing the commits from two parallel development track mixed together.</p>
</blockquote>
<p>
–reverse</p>
<blockquote>
<p>Output the commits chosen to be shown (see Commit Limiting section
above) in reverse order. Cannot be combined with <strong>–walk-reflogs</strong>.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-8" class="outline-3">
<h3 id="headline-8">
Object Traversal
</h3>
<div id="outline-text-headline-8" class="outline-text-3">
<p>These options are mostly targeted for packing of Git repositories.</p>
<p>
–no-walk[=(sorted|unsorted)]</p>
<blockquote>
<p>Only show the given commits, but do not traverse their ancestors. This
has no effect if a range is specified. If the argument <strong>unsorted</strong> is
given, the commits are shown in the order they were given on the command
line. Otherwise (if <strong>sorted</strong> or no argument was given), the commits are
shown in reverse chronological order by commit time. Cannot be combined
with <strong>–graph</strong>.</p>
</blockquote>
<p>
–do-walk</p>
<blockquote>
<p>Overrides a previous <strong>–no-walk</strong>.</p>
</blockquote>
</div>
</div>
