content/man/man1/git-replay.1.org
** Commit Formatting
--pretty[=<format>], --format=<format>

#+begin_quote
Pretty-print the contents of the commit logs in a given format, where
/<format>/ can be one of /oneline/, /short/, /medium/, /full/, /fuller/,
/reference/, /email/, /raw/, /format:<string>/ and /tformat:<string>/.
When /<format>/ is none of the above, and has /%placeholder/ in it, it
acts as if /--pretty=tformat:<format>/ were given.

See the "PRETTY FORMATS" section for some additional details for each
format. When /=<format>/ part is omitted, it defaults to /medium/.

Note: you can specify the default pretty format in the repository
configuration (see *git-config*(1)).

#+end_quote

--abbrev-commit

#+begin_quote
Instead of showing the full 40-byte hexadecimal commit object name, show
a prefix that names the object uniquely. "--abbrev=<n>" (which also
modifies diff output, if it is displayed) option can be used to specify
the minimum length of the prefix.

This should make "--pretty=oneline" a whole lot more readable for people
using 80-column terminals.

#+end_quote

--no-abbrev-commit

#+begin_quote
Show the full 40-byte hexadecimal commit object name. This negates
*--abbrev-commit*, either explicit or implied by other options such as
"--oneline". It also overrides the *log.abbrevCommit* variable.

#+end_quote

--oneline

#+begin_quote
This is a shorthand for "--pretty=oneline --abbrev-commit" used
together.

#+end_quote

--encoding=<encoding>

#+begin_quote
Commit objects record the character encoding used for the log message in
their encoding header; this option can be used to tell the command to
re-code the commit log message in the encoding preferred by the user.
For non plumbing commands this defaults to UTF-8. Note that if an object
claims to be encoded in *X* and we are outputting in *X*, we will output
the object verbatim; this means that invalid sequences in the original
commit may be copied to the output. Likewise, if iconv(3) fails to
convert the commit, we will quietly output the original object verbatim.

#+end_quote

--expand-tabs=<n>, --expand-tabs, --no-expand-tabs

#+begin_quote
Perform a tab expansion (replace each tab with enough spaces to fill to
the next display column that is a multiple of /<n>/) in the log message
before showing it in the output. *--expand-tabs* is a short-hand for
*--expand-tabs=8*, and *--no-expand-tabs* is a short-hand for
*--expand-tabs=0*, which disables tab expansion.

By default, tabs are expanded in pretty formats that indent the log
message by 4 spaces (i.e. /medium/, which is the default, /full/, and
/fuller/).

#+end_quote

--notes[=<ref>]

#+begin_quote
Show the notes (see *git-notes*(1)) that annotate the commit, when
showing the commit log message. This is the default for *git log*, *git
show* and *git whatchanged* commands when there is no *--pretty*,
*--format*, or *--oneline* option given on the command line.

By default, the notes shown are from the notes refs listed in the
*core.notesRef* and *notes.displayRef* variables (or corresponding
environment overrides). See *git-config*(1) for more details.

With an optional /<ref>/ argument, use the ref to find the notes to
display. The ref can specify the full refname when it begins with
*refs/notes/*; when it begins with *notes/*, *refs/* and otherwise
*refs/notes/* is prefixed to form the full name of the ref.

Multiple --notes options can be combined to control which notes are
being displayed. Examples: "--notes=foo" will show only notes from
"refs/notes/foo"; "--notes=foo --notes" will show both notes from
"refs/notes/foo" and from the default notes ref(s).

#+end_quote

--no-notes

#+begin_quote
Do not show notes. This negates the above *--notes* option, by resetting
the list of notes refs from which notes are shown. Options are parsed in
the order given on the command line, so e.g. "--notes --notes=foo
--no-notes --notes=bar" will only show notes from "refs/notes/bar".

#+end_quote

--show-notes-by-default

#+begin_quote
Show the default notes unless options for displaying specific notes are
given.

#+end_quote

--show-notes[=<ref>], --[no-]standard-notes

#+begin_quote
These options are deprecated. Use the above --notes/--no-notes options
instead.

#+end_quote

--show-signature

#+begin_quote
Check the validity of a signed commit object by passing the signature to
*gpg --verify* and show the output.

#+end_quote

--relative-date

#+begin_quote
Synonym for *--date=relative*.

#+end_quote

--date=<format>

#+begin_quote
Only takes effect for dates shown in human-readable format, such as when
using *--pretty*. *log.date* config variable sets a default value for
the log command's *--date* option. By default, dates are shown in the
original time zone (either committer's or author's). If *-local* is
appended to the format (e.g., *iso-local*), the user's local time zone
is used instead.

*--date=relative* shows dates relative to the current time, e.g. “2
hours ago”. The *-local* option has no effect for *--date=relative*.

*--date=local* is an alias for *--date=default-local*.

*--date=iso* (or *--date=iso8601*) shows timestamps in a ISO 8601-like
format. The differences to the strict ISO 8601 format are:

#+begin_quote
·

a space instead of the *T* date/time delimiter

#+end_quote

#+begin_quote
·

a space between time and time zone

#+end_quote

#+begin_quote
·

no colon between hours and minutes of the time zone

#+end_quote

*--date=iso-strict* (or *--date=iso8601-strict*) shows timestamps in
strict ISO 8601 format.

*--date=rfc* (or *--date=rfc2822*) shows timestamps in RFC 2822 format,
often found in email messages.

*--date=short* shows only the date, but not the time, in *YYYY-MM-DD*
format.

*--date=raw* shows the date as seconds since the epoch (1970-01-01
00:00:00 UTC), followed by a space, and then the timezone as an offset
from UTC (a *+* or *-* with four digits; the first two are hours, and
the second two are minutes). I.e., as if the timestamp were formatted
with *strftime("%s %z")*). Note that the *-local* option does not affect
the seconds-since-epoch value (which is always measured in UTC), but
does switch the accompanying timezone value.

*--date=human* shows the timezone if the timezone does not match the
current time-zone, and doesn't print the whole date if that matches (ie
skip printing year for dates that are "this year", but also skip the
whole date itself if it's in the last few days and we can just say what
weekday it was). For older dates the hour and minute is also omitted.

*--date=unix* shows the date as a Unix epoch timestamp (seconds since
1970). As with *--raw*, this is always in UTC and therefore *-local* has
no effect.

*--date=format:...* feeds the format *...* to your system *strftime*,
except for %s, %z, and %Z, which are handled internally. Use
*--date=format:%c* to show the date in your system locale's preferred
format. See the *strftime* manual for a complete list of format
placeholders. When using *-local*, the correct syntax is
*--date=format-local:...*.

*--date=default* is the default format, and is based on ctime(3) output.
It shows a single line with three-letter day of the week, three-letter
month, day-of-month, hour-minute-seconds in "HH:MM:SS" format, followed
by 4-digit year, plus timezone information, unless the local time zone
is used, e.g. *Thu Jan 1 00:00:00 1970 +0000*.

#+end_quote

--parents

#+begin_quote
Print also the parents of the commit (in the form "commit parent...").
Also enables parent rewriting, see /History Simplification/ above.

#+end_quote

--children

#+begin_quote
Print also the children of the commit (in the form "commit child...").
Also enables parent rewriting, see /History Simplification/ above.

#+end_quote

--left-right

#+begin_quote
Mark which side of a symmetric difference a commit is reachable from.
Commits from the left side are prefixed with *<* and those from the
right with *>*. If combined with *--boundary*, those commits are
prefixed with *-*.

For example, if you have this topology:

#+begin_quote
#+begin_example
             y---b---b  branch B
            / \ /
           /   .
          /   / \
         o---x---a---a  branch A
#+end_example

#+end_quote

you would get an output like this:

#+begin_quote
#+begin_example
        $ git rev-list --left-right --boundary --pretty=oneline A...B

        >bbbbbbb... 3rd on b
        >bbbbbbb... 2nd on b
        <aaaaaaa... 3rd on a
        <aaaaaaa... 2nd on a
        -yyyyyyy... 1st on b
        -xxxxxxx... 1st on a
#+end_example

#+end_quote

#+end_quote

--graph

#+begin_quote
Draw a text-based graphical representation of the commit history on the
left hand side of the output. This may cause extra lines to be printed
in between commits, in order for the graph history to be drawn properly.
Cannot be combined with *--no-walk*.

This enables parent rewriting, see /History Simplification/ above.

This implies the *--topo-order* option by default, but the
*--date-order* option may also be specified.

#+end_quote

--show-linear-break[=<barrier>]

#+begin_quote
When --graph is not used, all history branches are flattened which can
make it hard to see that the two consecutive commits do not belong to a
linear branch. This option puts a barrier in between them in that case.
If *<barrier>* is specified, it is the string that will be shown instead
of the default one.

#+end_quote

