public/man/man1/git-replay.1/index.html
<div id="outline-container-headline-9" class="outline-3">
<h3 id="headline-9">
Commit Formatting
</h3>
<div id="outline-text-headline-9" class="outline-text-3">
<p>–pretty[=&lt;format&gt;], –format=&lt;format&gt;</p>
<blockquote>
<p>Pretty-print the contents of the commit logs in a given format, where
<em>&lt;format&gt;</em> can be one of <em>oneline</em>, <em>short</em>, <em>medium</em>, <em>full</em>, <em>fuller</em>,
<em>reference</em>, <em>email</em>, <em>raw</em>, <em>format:&lt;string&gt;</em> and <em>tformat:&lt;string&gt;</em>.
When <em>&lt;format&gt;</em> is none of the above, and has <em>%placeholder</em> in it, it
acts as if <em>–pretty=tformat:&lt;format&gt;</em> were given.</p>
<p>
See the &#34;PRETTY FORMATS&#34; section for some additional details for each
format. When <em>=&lt;format&gt;</em> part is omitted, it defaults to <em>medium</em>.</p>
<p>
Note: you can specify the default pretty format in the repository
configuration (see *git-config*(1)).</p>
</blockquote>
<p>
–abbrev-commit</p>
<blockquote>
<p>Instead of showing the full 40-byte hexadecimal commit object name, show
a prefix that names the object uniquely. &#34;–abbrev=&lt;n&gt;&#34; (which also
modifies diff output, if it is displayed) option can be used to specify
the minimum length of the prefix.</p>
<p>
This should make &#34;–pretty=oneline&#34; a whole lot more readable for people
using 80-column terminals.</p>
</blockquote>
<p>
–no-abbrev-commit</p>
<blockquote>
<p>Show the full 40-byte hexadecimal commit object name. This negates
<strong>–abbrev-commit</strong>, either explicit or implied by other options such as
&#34;–oneline&#34;. It also overrides the <strong>log.abbrevCommit</strong> variable.</p>
</blockquote>
<p>
–oneline</p>
<blockquote>
<p>This is a shorthand for &#34;–pretty=oneline –abbrev-commit&#34; used
together.</p>
</blockquote>
<p>
–encoding=&lt;encoding&gt;</p>
<blockquote>
<p>Commit objects record the character encoding used for the log message in
their encoding header; this option can be used to tell the command to
re-code the commit log message in the encoding preferred by the user.
For non plumbing commands this defaults to UTF-8. Note that if an object
claims to be encoded in <strong>X</strong> and we are outputting in <strong>X</strong>, we will output
the object verbatim; this means that invalid sequences in the original
commit may be copied to the output. Likewise, if iconv(3) fails to
convert the commit, we will quietly output the original object verbatim.</p>
</blockquote>
<p>
–expand-tabs=&lt;n&gt;, –expand-tabs, –no-expand-tabs</p>
<blockquote>
<p>Perform a tab expansion (replace each tab with enough spaces to fill to
the next display column that is a multiple of <em>&lt;n&gt;</em>) in the log message
before showing it in the output. <strong>–expand-tabs</strong> is a short-hand for
<strong>–expand-tabs=8</strong>, and <strong>–no-expand-tabs</strong> is a short-hand for
<strong>–expand-tabs=0</strong>, which disables tab expansion.</p>
<p>
By default, tabs are expanded in pretty formats that indent the log
message by 4 spaces (i.e. <em>medium</em>, which is the default, <em>full</em>, and
<em>fuller</em>).</p>
</blockquote>
<p>
–notes[=&lt;ref&gt;]</p>
<blockquote>
<p>Show the notes (see <strong>git-notes*(1)) that annotate the commit, when
showing the commit log message. This is the default for *git log</strong>, <strong>git
show</strong> and <strong>git whatchanged</strong> commands when there is no <strong>–pretty</strong>,
<strong>–format</strong>, or <strong>–oneline</strong> option given on the command line.</p>
<p>
By default, the notes shown are from the notes refs listed in the
<strong>core.notesRef</strong> and <strong>notes.displayRef</strong> variables (or corresponding
environment overrides). See *git-config*(1) for more details.</p>
<p>
With an optional <em>&lt;ref&gt;</em> argument, use the ref to find the notes to
display. The ref can specify the full refname when it begins with
<strong>refs/notes/</strong>; when it begins with <strong>notes/</strong>, <strong>refs/</strong> and otherwise
<strong>refs/notes/</strong> is prefixed to form the full name of the ref.</p>
<p>
Multiple –notes options can be combined to control which notes are
being displayed. Examples: &#34;–notes=foo&#34; will show only notes from
&#34;refs/notes/foo&#34;; &#34;–notes=foo –notes&#34; will show both notes from
&#34;refs/notes/foo&#34; and from the default notes ref(s).</p>
</blockquote>
<p>
–no-notes</p>
<blockquote>
<p>Do not show notes. This negates the above <strong>–notes</strong> option, by resetting
the list of notes refs from which notes are shown. Options are parsed in
the order given on the command line, so e.g. &#34;–notes –notes=foo
–no-notes –notes=bar&#34; will only show notes from &#34;refs/notes/bar&#34;.</p>
</blockquote>
<p>
–show-notes-by-default</p>
<blockquote>
<p>Show the default notes unless options for displaying specific notes are
given.</p>
</blockquote>
<p>
–show-notes[=&lt;ref&gt;], –[no-]standard-notes</p>
<blockquote>
<p>These options are deprecated. Use the above –notes/–no-notes options
instead.</p>
</blockquote>
<p>
–show-signature</p>
<blockquote>
<p>Check the validity of a signed commit object by passing the signature to
<strong>gpg –verify</strong> and show the output.</p>
</blockquote>
<p>
–relative-date</p>
<blockquote>
<p>Synonym for <strong>–date=relative</strong>.</p>
</blockquote>
<p>
–date=&lt;format&gt;</p>
<blockquote>
<p>Only takes effect for dates shown in human-readable format, such as when
using <strong>–pretty</strong>. <strong>log.date</strong> config variable sets a default value for
the log command&#39;s <strong>–date</strong> option. By default, dates are shown in the
original time zone (either committer&#39;s or author&#39;s). If <strong>-local</strong> is
appended to the format (e.g., <strong>iso-local</strong>), the user&#39;s local time zone
is used instead.</p>
<p>
<strong>–date=relative</strong> shows dates relative to the current time, e.g. “2
hours ago”. The <strong>-local</strong> option has no effect for <strong>–date=relative</strong>.</p>
<p>
<strong>–date=local</strong> is an alias for <strong>–date=default-local</strong>.</p>
<p>
<strong>–date=iso</strong> (or <strong>–date=iso8601</strong>) shows timestamps in a ISO 8601-like
format. The differences to the strict ISO 8601 format are:</p>
<blockquote>
<p>·</p>
<p>
a space instead of the <strong>T</strong> date/time delimiter</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
a space between time and time zone</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
no colon between hours and minutes of the time zone</p>
</blockquote>
<p>
<strong>–date=iso-strict</strong> (or <strong>–date=iso8601-strict</strong>) shows timestamps in
strict ISO 8601 format.</p>
<p>
<strong>–date=rfc</strong> (or <strong>–date=rfc2822</strong>) shows timestamps in RFC 2822 format,
often found in email messages.</p>
<p>
<strong>–date=short</strong> shows only the date, but not the time, in <strong>YYYY-MM-DD</strong>
format.</p>
<p>
<strong>–date=raw</strong> shows the date as seconds since the epoch (1970-01-01
00:00:00 UTC), followed by a space, and then the timezone as an offset
from UTC (a <strong>+</strong> or <strong>-</strong> with four digits; the first two are hours, and
the second two are minutes). I.e., as if the timestamp were formatted
with <strong>strftime(&#34;%s %z&#34;)</strong>). Note that the <strong>-local</strong> option does not affect
the seconds-since-epoch value (which is always measured in UTC), but
does switch the accompanying timezone value.</p>
<p>
<strong>–date=human</strong> shows the timezone if the timezone does not match the
current time-zone, and doesn&#39;t print the whole date if that matches (ie
skip printing year for dates that are &#34;this year&#34;, but also skip the
whole date itself if it&#39;s in the last few days and we can just say what
weekday it was). For older dates the hour and minute is also omitted.</p>
<p>
<strong>–date=unix</strong> shows the date as a Unix epoch timestamp (seconds since
1970). As with <strong>–raw</strong>, this is always in UTC and therefore <strong>-local</strong> has
no effect.</p>
<p>
<strong>–date=format:…</strong> feeds the format <strong>…</strong> to your system <strong>strftime</strong>,
except for %s, %z, and %Z, which are handled internally. Use
<strong>–date=format:%c</strong> to show the date in your system locale&#39;s preferred
format. See the <strong>strftime</strong> manual for a complete list of format
placeholders. When using <strong>-local</strong>, the correct syntax is
<strong>–date=format-local:…</strong>.</p>
<p>
<strong>–date=default</strong> is the default format, and is based on ctime(3) output.
It shows a single line with three-letter day of the week, three-letter
month, day-of-month, hour-minute-seconds in &#34;HH:MM:SS&#34; format, followed
by 4-digit year, plus timezone information, unless the local time zone
is used, e.g. <strong>Thu Jan 1 00:00:00 1970 +0000</strong>.</p>
</blockquote>
<p>
–parents</p>
<blockquote>
<p>Print also the parents of the commit (in the form &#34;commit parent…&#34;).
Also enables parent rewriting, see <em>History Simplification</em> above.</p>
</blockquote>
<p>
–children</p>
<blockquote>
<p>Print also the children of the commit (in the form &#34;commit child…&#34;).
Also enables parent rewriting, see <em>History Simplification</em> above.</p>
</blockquote>
<p>
–left-right</p>
<blockquote>
<p>Mark which side of a symmetric difference a commit is reachable from.
Commits from the left side are prefixed with <strong>&lt;</strong> and those from the
right with <strong>&gt;</strong>. If combined with <strong>–boundary</strong>, those commits are
prefixed with <strong>-</strong>.</p>
<p>
For example, if you have this topology:</p>
<blockquote>
<pre class="example">
             y---b---b  branch B
            / \ /
           /   .
          /   / \
         o---x---a---a  branch A
</pre>
</blockquote>
<p>
you would get an output like this:</p>
<blockquote>
<pre class="example">
        $ git rev-list --left-right --boundary --pretty=oneline A...B

        &gt;bbbbbbb... 3rd on b
        &gt;bbbbbbb... 2nd on b
        &lt;aaaaaaa... 3rd on a
        &lt;aaaaaaa... 2nd on a
        -yyyyyyy... 1st on b
        -xxxxxxx... 1st on a
</pre>
</blockquote>
</blockquote>
<p>
–graph</p>
<blockquote>
<p>Draw a text-based graphical representation of the commit history on the
left hand side of the output. This may cause extra lines to be printed
in between commits, in order for the graph history to be drawn properly.
Cannot be combined with <strong>–no-walk</strong>.</p>
<p>
This enables parent rewriting, see <em>History Simplification</em> above.</p>
<p>
This implies the <strong>–topo-order</strong> option by default, but the
<strong>–date-order</strong> option may also be specified.</p>
</blockquote>
<p>
–show-linear-break[=&lt;barrier&gt;]</p>
<blockquote>
<p>When –graph is not used, all history branches are flattened which can
make it hard to see that the two consecutive commits do not belong to a
linear branch. This option puts a barrier in between them in that case.
If <strong>&lt;barrier&gt;</strong> is specified, it is the string that will be shown instead
of the default one.</p>
</blockquote>
</div>
</div>
</div>
</div>
