content/man/man1/git-replay.1.org
* OUTPUT
When there are no conflicts, the output of this command is usable as
input to *git update-ref --stdin*. It is of the form:

#+begin_quote
#+begin_example
update refs/heads/branch1 ${NEW_branch1_HASH} ${OLD_branch1_HASH}
update refs/heads/branch2 ${NEW_branch2_HASH} ${OLD_branch2_HASH}
update refs/heads/branch3 ${NEW_branch3_HASH} ${OLD_branch3_HASH}
#+end_example

#+end_quote

where the number of refs updated depends on the arguments passed and the
shape of the history being replayed. When using *--advance*, the number
of refs updated is always one, but for *--onto*, it can be one or more
(rebasing multiple branches simultaneously is supported).

* EXIT STATUS
For a successful, non-conflicted replay, the exit status is 0. When the
replay has conflicts, the exit status is 1. If the replay is not able to
complete (or start) due to some kind of error, the exit status is
something other than 0 or 1.

* EXAMPLES
To simply rebase *mybranch* onto *target*:

#+begin_quote
#+begin_example
$ git replay --onto target origin/main..mybranch
update refs/heads/mybranch ${NEW_mybranch_HASH} ${OLD_mybranch_HASH}
#+end_example

#+end_quote

To cherry-pick the commits from mybranch onto target:

#+begin_quote
#+begin_example
$ git replay --advance target origin/main..mybranch
update refs/heads/target ${NEW_target_HASH} ${OLD_target_HASH}
#+end_example

#+end_quote

Note that the first two examples replay the exact same commits and on
top of the exact same new base, they only differ in that the first
provides instructions to make mybranch point at the new commits and the
second provides instructions to make target point at them.

What if you have a stack of branches, one depending upon another, and
you'd really like to rebase the whole set?

#+begin_quote
#+begin_example
$ git replay --contained --onto origin/main origin/main..tipbranch
update refs/heads/branch1 ${NEW_branch1_HASH} ${OLD_branch1_HASH}
update refs/heads/branch2 ${NEW_branch2_HASH} ${OLD_branch2_HASH}
update refs/heads/tipbranch ${NEW_tipbranch_HASH} ${OLD_tipbranch_HASH}
#+end_example

#+end_quote

When calling *git replay*, one does not need to specify a range of
commits to replay using the syntax *A..B*; any range expression will do:

#+begin_quote
#+begin_example
$ git replay --onto origin/main ^base branch1 branch2 branch3
update refs/heads/branch1 ${NEW_branch1_HASH} ${OLD_branch1_HASH}
update refs/heads/branch2 ${NEW_branch2_HASH} ${OLD_branch2_HASH}
update refs/heads/branch3 ${NEW_branch3_HASH} ${OLD_branch3_HASH}
#+end_example

#+end_quote

This will simultaneously rebase *branch1*, *branch2*, and *branch3*, all
commits they have since *base*, playing them on top of *origin/main*.
These three branches may have commits on top of *base* that they have in
common, but that does not need to be the case.

* GIT
Part of the *git*(1) suite
