public/man/man1/git-replay.1/index.html
<div id="outline-container-headline-10" class="outline-2">
<h2 id="headline-10">
OUTPUT
</h2>
<div id="outline-text-headline-10" class="outline-text-2">
<p>When there are no conflicts, the output of this command is usable as
input to <strong>git update-ref –stdin</strong>. It is of the form:</p>
<blockquote>
<pre class="example">
update refs/heads/branch1 ${NEW_branch1_HASH} ${OLD_branch1_HASH}
update refs/heads/branch2 ${NEW_branch2_HASH} ${OLD_branch2_HASH}
update refs/heads/branch3 ${NEW_branch3_HASH} ${OLD_branch3_HASH}
</pre>
</blockquote>
<p>
where the number of refs updated depends on the arguments passed and the
shape of the history being replayed. When using <strong>–advance</strong>, the number
of refs updated is always one, but for <strong>–onto</strong>, it can be one or more
(rebasing multiple branches simultaneously is supported).</p>
</div>
</div>
<div id="outline-container-headline-11" class="outline-2">
<h2 id="headline-11">
EXIT STATUS
</h2>
<div id="outline-text-headline-11" class="outline-text-2">
<p>For a successful, non-conflicted replay, the exit status is 0. When the
replay has conflicts, the exit status is 1. If the replay is not able to
complete (or start) due to some kind of error, the exit status is
something other than 0 or 1.</p>
</div>
</div>
<div id="outline-container-headline-12" class="outline-2">
<h2 id="headline-12">
EXAMPLES
</h2>
<div id="outline-text-headline-12" class="outline-text-2">
<p>To simply rebase <strong>mybranch</strong> onto <strong>target</strong>:</p>
<blockquote>
<pre class="example">
$ git replay --onto target origin/main..mybranch
update refs/heads/mybranch ${NEW_mybranch_HASH} ${OLD_mybranch_HASH}
</pre>
</blockquote>
<p>
To cherry-pick the commits from mybranch onto target:</p>
<blockquote>
<pre class="example">
$ git replay --advance target origin/main..mybranch
update refs/heads/target ${NEW_target_HASH} ${OLD_target_HASH}
</pre>
</blockquote>
<p>
Note that the first two examples replay the exact same commits and on
top of the exact same new base, they only differ in that the first
provides instructions to make mybranch point at the new commits and the
second provides instructions to make target point at them.</p>
<p>
What if you have a stack of branches, one depending upon another, and
you&#39;d really like to rebase the whole set?</p>
<blockquote>
<pre class="example">
$ git replay --contained --onto origin/main origin/main..tipbranch
update refs/heads/branch1 ${NEW_branch1_HASH} ${OLD_branch1_HASH}
update refs/heads/branch2 ${NEW_branch2_HASH} ${OLD_branch2_HASH}
update refs/heads/tipbranch ${NEW_tipbranch_HASH} ${OLD_tipbranch_HASH}
</pre>
</blockquote>
<p>
When calling <strong>git replay</strong>, one does not need to specify a range of
commits to replay using the syntax <strong>A..B</strong>; any range expression will do:</p>
<blockquote>
<pre class="example">
$ git replay --onto origin/main ^base branch1 branch2 branch3
update refs/heads/branch1 ${NEW_branch1_HASH} ${OLD_branch1_HASH}
update refs/heads/branch2 ${NEW_branch2_HASH} ${OLD_branch2_HASH}
update refs/heads/branch3 ${NEW_branch3_HASH} ${OLD_branch3_HASH}
</pre>
</blockquote>
<p>
This will simultaneously rebase <strong>branch1</strong>, <strong>branch2</strong>, and <strong>branch3</strong>, all
commits they have since <strong>base</strong>, playing them on top of <strong>origin/main</strong>.
These three branches may have commits on top of <strong>base</strong> that they have in
common, but that does not need to be the case.</p>
</div>
</div>
<div id="outline-container-headline-13" class="outline-2">
<h2 id="headline-13">
GIT
</h2>
<div id="outline-text-headline-13" class="outline-text-2">
<p>Part of the *git*(1) suite</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.95916b5b8c09add4922ea47e674b5da7fc4b6347a3e8c4e25e98b4b7d236080b.js" integrity="sha256-lZFrW4wJrdSSLqR&#43;Z0tdp/xLY0ej6MTiXpi0t9I2CAs=" crossorigin="anonymous"></script>
    </body>
</html>
